{
  "pageConfig": {
    "title": "Eat & Drink",
    "subtitle": "Discover Tirana's vibrant food and drink scene",
    "categories": [
      {
        "id": "coffee",
        "name": "Coffee & Brunch",
        "icon": "",
        "description": "Cozy cafés and brunch spots with Albanian coffee culture",
        "dataSource": "coffee-shops",
        "backgroundImageUrl": "https://assets.albaniatravelcompanion.com/district.webp",
        "gradientColors": [
          "rgba(0,0,0,0.4)",
          "rgba(0,0,0,0.6)"
        ],
        "localInsight": [
          {
            "title": "Local Secret",
            "message": "While espresso in Albania is great, also try 'kafe turke'. Ask for it 'pa sheqer' (without sugar) to taste it authentically."
          },
          {
            "title": "Local Secret",
            "message": "The social heart of Albanian mornings are 'byrek' (savory pastry) and coffee."
          }
        ]
      },
      {
        "id": "restaurants",
        "name": "Restaurants",
        "icon": "",
        "description": "From traditional Albanian cuisine to international favorites",
        "dataSource": "restaurants",
        "backgroundImageUrl": "https://assets.albaniatravelcompanion.com/mullixhiu.webp",
        "gradientColors": [
          "rgba(0,0,0,0.4)",
          "rgba(0,0,0,0.6)"
        ],
        "localInsight": [
          {
            "title": "Local Secret",
            "message": "During lunch times ask for the 'menu of the day' - locals get better prices on unlisted daily specials not shown to tourists. It's usually the freshest and most authentic option."
          },
          {
            "title": "Local Secret",
            "message": "Tipping 10% is standard but not mandatory. Round up to the nearest 100 lek or leave small change - locals don't tip excessively like in tourist areas."
          }
        ]
      },
      {
        "id": "bars",
        "name": "Cocktails & Bars",
        "icon": "",
        "description": "Local bars, craft beer, and traditional raki spots",
        "dataSource": "bars",
        "backgroundImageUrl": "https://assets.albaniatravelcompanion.com/kino.webp",
        "gradientColors": [
          "rgba(0,0,0,0.4)",
          "rgba(0,0,0,0.6)"
        ],
        "localInsight": [
          {
            "title": "Local Secret",
            "message": "Pre-drink at neighborhood bars before hitting tourist spots - hidden bars cost 1/3 the price for the same drinks. Look for places with no English menus for the best deals."
          },
          {
            "title": "Local Secret",
            "message": "Try 'raki' with locals - it's Albania's national spirit. Order it neat, never mixed, and always accept when offered. It's a sign of friendship and respect."
          }
        ]
      },
      {
        "id": "quick",
        "name": "Quick Bites",
        "icon": "",
        "description": "Fast food, street food, bakeries and grab-and-go options",
        "dataSource": "bakeries-qsr",
        "backgroundImageUrl": "https://assets.albaniatravelcompanion.com/smash_burger_tirana.webp",
        "gradientColors": [
          "rgba(0,0,0,0.4)",
          "rgba(0,0,0,0.6)"
        ],
        "localInsight": [
          {
            "title": "Local Secret",
            "message": "Street vendors near bus stations usually have the freshest burek."
          },
          {
            "title": "Local Secret",
            "message": "Always carry small bills (20, 50, 100 lek notes) - street vendors often don't have change for large bills."
          }
        ]
      }
    ],
    "defaultMessage": {
      "title": "Select a category to get started",
      "description": "Choose from coffee shops, restaurants, bars, and more to explore Tirana's amazing food and drink scene"
    }
  },
  "data": {
    "coffee-shops": [
      {
        "id": "mulliri-vjeter",
        "name": "Mulliri i Vjetër",
        "shortDescription": "Popular coffee chain known for quality espresso, cappuccinos, and modern café atmosphere with multiple locations across Tirana.",
        "location": "Pazari i Ri area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/mulliri.jpg",
        "type": "coffee",
        "detailedDescription": "Mulliri i Vjetër (The Old Mill) is one of Tirana's first and most beloved coffee chains, establishing itself as a cornerstone of the city's café culture. Known for serving high-quality espresso, cappuccinos, lattes, and frappes, along with fresh pastries and light snacks. With multiple locations throughout Tirana, this modern coffee shop offers a cozy atmosphere reminiscent of international café chains while maintaining its Albanian roots. Popular with both locals and visitors, it's the perfect spot for business meetings, casual catch-ups, or simply enjoying excellent coffee.",
        "keyFeatures": [
          "Premium Coffee - High-quality espresso, cappuccinos, and specialty drinks",
          "Multiple Locations - Chain with outlets throughout Tirana",
          "Modern Atmosphere - Cozy, contemporary café environment",
          "Fresh Pastries - Daily selection of croissants, cakes, and light snacks",
          "Local Institution - Established coffee chain beloved by locals and visitors"
        ],
        "visitingInfo": "Open daily 6:30-22:00. Peak times 7:00-9:00 and 17:00-19:00. Accepts cash and cards. English-speaking staff available. WiFi available for remote work.",
        "bestTimeToVisit": "Early morning (7:00-9:00) for fresh coffee and pastries. Mid-afternoon (14:00-16:00) for quieter atmosphere and laptop work.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Mulliri+i+Vjeter+Tirana+Albania"
      },
      {
        "id": "florum",
        "name": "FLORUM",
        "shortDescription": "Chic botanical café with specialty coffee, fresh pastries, and a garden-inspired atmosphere perfect for brunch.",
        "location": "Rruga e Kavajës, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/florum.jpeg",
        "type": "coffee",
        "detailedDescription": "FLORUM is Tirana's premier botanical café, combining specialty coffee culture with a stunning plant-filled interior. Known for their expertly crafted coffee drinks, fresh croissants, and Instagram-worthy brunch plates. The café features abundant greenery, natural lighting, and a peaceful atmosphere that makes it perfect for both casual meetings and leisurely weekend brunches.",
        "keyFeatures": [
          "Specialty Coffee - Expert baristas and premium beans",
          "Botanical Interior - Beautiful plant-filled space",
          "Fresh Pastries - Daily-baked croissants and sweets",
          "Brunch Menu - Avocado toast, eggs benedict, and healthy bowls",
          "Instagram Worthy - Photogenic food and décor"
        ],
        "visitingInfo": "Open daily 7:00-22:00. Free WiFi available. Accepts cards and cash. Popular brunch spot - arrive early on weekends. Outdoor seating available in good weather.",
        "bestTimeToVisit": "Morning hours (8:00-11:00) for freshest pastries and quieter atmosphere. Weekend brunch service 9:00-14:00.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=FLORUM+cafe+Tirana+Albania"
      },
      {
        "id": "destil-creative-hub",
        "name": "Destil Creative Hub Tirana",
        "shortDescription": "Trendy creative space combining excellent coffee, coworking areas, and artistic events just 5 minutes from the apartment.",
        "location": "Rruga Abdyl Frashëri, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/destil.webp",
        "type": "coffee",
        "detailedDescription": "Destil Creative Hub is more than just a café - it's a vibrant community space where coffee culture meets creativity. Located just 5 minutes from the apartment, this trendy spot offers specialty coffee, healthy breakfast options, and regularly hosts art exhibitions, workshops, and networking events. The industrial-chic design and collaborative atmosphere make it popular with digital nomads and local creatives.",
        "keyFeatures": [
          "Creative Community - Regular art events and workshops",
          "Coworking Space - Dedicated work areas with fast WiFi",
          "Specialty Coffee - Third-wave coffee culture",
          "Healthy Options - Smoothie bowls, avocado toast, and fresh juices",
          "Convenient Location - Just 5 minutes from apartment"
        ],
        "visitingInfo": "Open Monday-Friday 7:30-23:00, weekends 8:00-23:00. Coworking day pass available. Free WiFi. Laptop-friendly environment. Event calendar available online.",
        "bestTimeToVisit": "Early morning (7:30-9:00) for productive work sessions. Evening events typically start at 19:00.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Destil+Creative+Hub+Tirana+Albania"
      },
      {
        "id": "hana-corner-cafe",
        "name": "HANA Corner Café",
        "shortDescription": "Cozy corner café known for exceptional coffee, homemade cakes, and warm hospitality in a charming neighborhood setting.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/Hana.webp",
        "type": "coffee",
        "detailedDescription": "HANA Corner Café embodies the perfect neighborhood coffee shop - intimate, welcoming, and consistently excellent. This family-run establishment has built a loyal following through their attention to detail, from perfectly extracted espresso to homemade cakes baked fresh daily. The cozy interior features comfortable seating, local artwork, and the kind of warm atmosphere that invites you to linger over your morning coffee.",
        "keyFeatures": [
          "Neighborhood Favorite - Beloved local coffee shop",
          "Homemade Cakes - Fresh-baked daily desserts",
          "Quality Coffee - Consistent, well-prepared espresso drinks",
          "Warm Atmosphere - Cozy, family-friendly environment",
          "Local Art - Supporting Tirana's artistic community"
        ],
        "visitingInfo": "Open daily 7:00-20:00. Cash preferred but cards accepted. Limited seating - popular with locals. Known for friendly, personal service.",
        "bestTimeToVisit": "Mid-morning (9:00-11:00) for freshest cakes and relaxed atmosphere. Afternoon (15:00-17:00) perfect for coffee and dessert.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=HANA+Corner+Cafe+Bllok+Tirana+Albania"
      },
      {
        "id": "oborri",
        "name": "Oborri",
        "shortDescription": "Charming courtyard café serving artisanal coffee and traditional Albanian breakfast in a beautifully restored historic building.",
        "location": "Rruga Myslym Shyri, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/Oborri.webp",
        "type": "coffee",
        "detailedDescription": "Oborri (meaning 'courtyard' in Albanian) is a hidden gem housed in a beautifully restored traditional building. The café combines modern coffee culture with Albanian heritage, offering both international coffee standards and traditional breakfast options. The peaceful courtyard setting provides an oasis from the bustling city streets, making it a favorite among both locals and visitors seeking authentic Albanian hospitality.",
        "keyFeatures": [
          "Historic Setting - Beautifully restored traditional building",
          "Peaceful Courtyard - Quiet outdoor seating area",
          "Albanian Breakfast - Traditional byrek and fresh dairy products",
          "Artisanal Coffee - Carefully sourced and expertly prepared",
          "Cultural Experience - Authentic Albanian café culture"
        ],
        "visitingInfo": "Open daily 7:00-21:00. Traditional Albanian breakfast served until 12:00. Courtyard seating weather-dependent. Cards and cash accepted.",
        "bestTimeToVisit": "Early morning (7:00-10:00) for traditional Albanian breakfast. Late afternoon (16:00-18:00) for peaceful courtyard experience.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Oborri+cafe+Tirana+Albania"
      },
      {
        "id": "cafe-botanica",
        "name": "Cafe Botanica",
        "shortDescription": "Garden-themed café with lush greenery, organic coffee, and healthy brunch options in a serene botanical setting.",
        "location": "Rruga Deshmoret e 4 Shkurtit, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/botanica.webp",
        "type": "coffee",
        "detailedDescription": "Cafe Botanica lives up to its name with an abundance of plants creating a greenhouse-like atmosphere in the heart of Tirana. Specializing in organic and fair-trade coffee, the café also offers an extensive menu of healthy breakfast and brunch options. The botanical theme extends to their food presentation, with edible flowers and herbs featured prominently in their dishes.",
        "keyFeatures": [
          "Botanical Paradise - Extensive plant collection creating jungle vibes",
          "Organic Coffee - Fair-trade and sustainably sourced beans",
          "Healthy Menu - Superfood bowls, fresh juices, and organic options",
          "Edible Gardens - Herbs and flowers used in food preparation",
          "Eco-Conscious - Sustainable practices and biodegradable packaging"
        ],
        "visitingInfo": "Open daily 8:00-20:00. Vegan and gluten-free options available. Plant care workshops occasionally held. Instagram-popular spot - expect crowds on weekends.",
        "bestTimeToVisit": "Morning light (8:00-10:00) showcases the plants beautifully. Weekday afternoons (14:00-16:00) for a peaceful experience.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Cafe+Botanica+Tirana+Albania"
      },
      {
        "id": "noor-coffee",
        "name": "Noor Coffee & Fine Food",
        "shortDescription": "Upscale café combining premium coffee with gourmet breakfast and lunch options in an elegant, modern setting.",
        "location": "Pazari i Ri area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/noor.jpg",
        "type": "coffee",
        "detailedDescription": "Noor Coffee & Fine Food represents the sophisticated side of Tirana's coffee scene, offering premium single-origin coffees alongside gourmet food options. The sleek, modern interior and professional service create an upscale dining experience. Their menu features both international favorites and Albanian-inspired dishes, all prepared with high-quality ingredients and artistic presentation.",
        "keyFeatures": [
          "Premium Coffee - Single-origin beans and expert preparation",
          "Gourmet Menu - High-quality breakfast and lunch options",
          "Elegant Interior - Modern, sophisticated design",
          "Professional Service - Attentive, knowledgeable staff",
          "Central Location - Near Pazari i Ri (New Bazaar)"
        ],
        "visitingInfo": "Open daily 7:00-22:00. Reservations recommended for weekend brunch. Higher price point than typical cafés. Full bar service available evenings.",
        "bestTimeToVisit": "Weekend brunch (10:00-14:00) for full menu experience. Evening (18:00-20:00) for coffee and aperitifs.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Noor+Coffee+Fine+Food+Tirana+Albania"
      },
      {
        "id": "the-crown-rooftop",
        "name": "The Crown Rooftop & Dining",
        "shortDescription": "Sophisticated rooftop café offering panoramic city views, premium coffee, and elevated brunch experience.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/the crown.webp",
        "type": "coffee",
        "detailedDescription": "The Crown Rooftop & Dining offers Tirana's most elevated coffee experience - literally. This sophisticated venue combines excellent coffee service with stunning panoramic views of the city and surrounding mountains. The rooftop setting creates a unique atmosphere for both casual coffee meetings and special brunch occasions, with weather permitting outdoor seating that showcases the best views in the city.",
        "keyFeatures": [
          "Panoramic Views - Best city views in Tirana",
          "Rooftop Setting - Unique elevated dining experience",
          "Premium Service - High-end café and restaurant standards",
          "Weather-Dependent - Outdoor seating subject to conditions",
          "Photo Opportunities - Instagram-perfect city views"
        ],
        "visitingInfo": "Open daily 8:00-24:00. Weather-dependent rooftop seating. Reservations recommended for weekend brunch. Dress code: smart casual. Elevator access available.",
        "bestTimeToVisit": "Clear mornings (9:00-11:00) for best views and coffee. Sunset hours (18:00-20:00) for spectacular lighting.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=The+Crown+Rooftop+Dining+Tirana+Albania"
      },
      {
        "id": "le-district",
        "name": "Le District (Pedonale)",
        "shortDescription": "French-inspired café on the pedestrian street offering authentic pastries, coffee, and Parisian café culture.",
        "location": "Rruga Pedonale, Tirana Center",
        "imageUrl": "https://assets.albaniatravelcompanion.com/district.webp",
        "type": "coffee",
        "detailedDescription": "Le District brings a touch of Parisian café culture to Tirana's main pedestrian street. This French-inspired establishment is renowned for its authentic croissants, pain au chocolat, and other traditional pastries made by French-trained bakers. The sidewalk seating provides perfect people-watching opportunities along the bustling pedestrian zone, while the interior maintains classic café bistro aesthetics.",
        "keyFeatures": [
          "French Pastries - Authentic croissants and pain au chocolat",
          "Pedestrian Street - Prime people-watching location",
          "Parisian Atmosphere - Classic French café aesthetics",
          "Professional Baking - French-trained pastry chefs",
          "Central Location - Heart of Tirana's shopping district"
        ],
        "visitingInfo": "Open daily 7:00-23:00. Busy pedestrian location - limited parking. French breakfast served until 12:00. Sidewalk seating popular but limited.",
        "bestTimeToVisit": "Early morning (7:00-9:00) for freshest pastries. Evening aperitif time (18:00-20:00) for bustling street atmosphere.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Le+District+Pedonale+Tirana+Albania"
      },
      {
        "id": "stephen-center",
        "name": "Stephen Center Café",
        "shortDescription": "Multi-level cultural center café combining excellent coffee with art exhibitions, bookstore, and events.",
        "location": "Rruga Ibrahim Rugova, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/stephen_center_caf.webp",
        "type": "coffee",
        "detailedDescription": "Stephen Center Café operates within a vibrant cultural center that includes art galleries, a bookstore, and event spaces. The café serves as a meeting point for Tirana's intellectual and artistic community, offering quality coffee alongside cultural programming. The multi-level space provides different atmospheres, from quiet reading areas to collaborative workspaces and exhibition viewing areas.",
        "keyFeatures": [
          "Cultural Hub - Art exhibitions, bookstore, and events",
          "Multi-Level Space - Different areas for various activities",
          "Intellectual Community - Popular with artists, writers, and academics",
          "Event Programming - Regular cultural events and book launches",
          "Book Collection - Curated selection of literature and art books"
        ],
        "visitingInfo": "Open Tuesday-Sunday 9:00-20:00, closed Mondays. Event schedule varies - check website. Art exhibitions change monthly. Book browsing encouraged while enjoying coffee.",
        "bestTimeToVisit": "Afternoon (14:00-17:00) for art viewing and quiet coffee. Evening events (18:00-20:00) for cultural programming.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Stephen+Center+Cafe+Tirana+Albania"
      },
      {
        "id": "kafe-flora",
        "name": "Kafe Flora",
        "shortDescription": "Historic iconic café from 1972, one of Albania's oldest coffee shops offering exceptional breakfast and traditional atmosphere.",
        "location": "Beginning of Durresi Street, intersection with Mine Peza Street, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/kafe_flora.jpg",
        "type": "coffee",
        "detailedDescription": "Kafe Flora holds a special place in Albanian history as one of the oldest coffee shops in the country, dating back to 1972 and even immortalized in song. This iconic establishment delivers exceptional breakfast experiences with top-tier ingredients and expert preparation. Located in a historic six-floor building, the café maintains its traditional charm while serving quality coffee and food at remarkably reasonable prices.",
        "keyFeatures": [
          "Historical Significance - One of Albania's oldest coffee shops from 1972",
          "Exceptional Breakfast - Top-tier ingredients and expert preparation",
          "Amazing Value - High quality at very reasonable prices",
          "Traditional Atmosphere - Historic charm with modern comfort",
          "Prime Location - Heart of Tirana near all major attractions"
        ],
        "visitingInfo": "Open daily for breakfast, lunch, and dinner. Features both indoor seating and outdoor terrace. Takeaway and delivery available. Cash and cards accepted.",
        "bestTimeToVisit": "Morning (8:00-11:00) for exceptional breakfast experience. Afternoon (15:00-17:00) for coffee and traditional atmosphere.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Kafe+Flora+Tirana+Albania"
      }
    ],
    "restaurants": [
      {
        "id": "golosa-pizzeria",
        "name": "Golosa Pizzeria Ristorante",
        "shortDescription": "Authentic Italian restaurant just 4 minutes from apartment, offering excellent food at great prices with traditional recipes.",
        "location": "4-minute walk from apartment, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/golosa_pizzeria_ristorante.webp",
        "type": "restaurant",
        "detailedDescription": "Golosa Pizzeria Ristorante combines the convenience of being just 4 minutes from the apartment with the authenticity of traditional Italian cuisine. This family-run establishment has built a loyal following through their commitment to quality ingredients, traditional preparation methods, and exceptional value for money. Their wood-fired pizza oven and homemade pasta make it a standout choice for both casual dining and special occasions.",
        "keyFeatures": [
          "Close Location - Just 4-minute walk from apartment",
          "Authentic Italian - Traditional recipes and preparation methods",
          "Excellent Value - Great food at reasonable prices",
          "Wood-Fired Pizza - Traditional oven for authentic flavor",
          "Homemade Pasta - Fresh preparation daily"
        ],
        "visitingInfo": "Open daily 12:00-24:00. Reservations recommended for dinner. English menu available. Cards and cash accepted. Popular with both locals and tourists.",
        "bestTimeToVisit": "Lunch hours (12:00-15:00) for quieter atmosphere. Dinner service (19:00-22:00) for full menu and ambiance.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Golosa+Pizzeria+Ristorante+Tirana+Albania"
      },
      {
        "id": "era-vila",
        "name": "Era Vila",
        "shortDescription": "Elegant restaurant in a beautiful villa setting offering refined Albanian and international cuisine with garden dining.",
        "location": "Rruga e Elbasanit, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/era vila.jpg",
        "type": "restaurant",
        "detailedDescription": "Era Vila transforms dining into an elegant experience within a beautifully restored villa surrounded by lush gardens. The restaurant specializes in refined Albanian cuisine alongside international favorites, all prepared with premium ingredients and artistic presentation. The romantic garden setting and sophisticated interior make it ideal for special occasions, business dinners, and memorable evenings.",
        "keyFeatures": [
          "Villa Setting - Beautiful historic building with character",
          "Garden Dining - Outdoor seating in landscaped gardens",
          "Refined Cuisine - Elevated Albanian and international dishes",
          "Elegant Atmosphere - Sophisticated interior and service",
          "Special Occasions - Perfect for romantic dinners and celebrations"
        ],
        "visitingInfo": "Open Tuesday-Sunday 12:00-23:00, closed Mondays. Reservations highly recommended. Higher price point. Dress code: smart casual. Garden seating weather-dependent.",
        "bestTimeToVisit": "Evening (19:00-21:00) for romantic garden dining. Sunday lunch (13:00-15:00) for peaceful garden atmosphere.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Era+Vila+restaurant+Tirana+Albania"
      },
      {
        "id": "artigiano-vila",
        "name": "Artigiano at Vila",
        "shortDescription": "Artisanal Italian restaurant in a charming villa, focusing on handcrafted pasta and traditional Italian techniques.",
        "location": "Vila area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/artigiano_at_vila.webp",
        "type": "restaurant",
        "detailedDescription": "Artigiano at Vila embodies the artisanal spirit of Italian cuisine, housed in a charming villa that provides an intimate dining environment. The restaurant specializes in handcrafted pasta made daily by skilled Italian chefs, using traditional techniques and imported Italian ingredients. Their commitment to authenticity extends to their wine selection, featuring carefully chosen Italian vintages that complement their artisanal menu.",
        "keyFeatures": [
          "Artisanal Focus - Handcrafted pasta and traditional techniques",
          "Villa Location - Intimate, charming dining environment",
          "Italian Authenticity - Imported ingredients and Italian chefs",
          "Wine Selection - Curated Italian wine list",
          "Small Batch - Limited production ensuring quality"
        ],
        "visitingInfo": "Open Wednesday-Monday 18:00-23:00, closed Tuesdays. Reservations essential. Italian wine pairings available. Higher price point for artisanal quality.",
        "bestTimeToVisit": "Early dinner (18:00-20:00) for intimate atmosphere. Weekend evenings (20:00-22:00) for full Italian dining experience.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Artigiano+at+Vila+restaurant+Tirana+Albania"
      },
      {
        "id": "oda-traditional",
        "name": "Oda - Traditional Albanian Restaurant",
        "shortDescription": "Authentic Albanian dining experience featuring traditional recipes, cultural décor, and live folk music performances.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/oda-garden.jpg",
        "type": "restaurant",
        "detailedDescription": "Oda provides the most authentic Albanian dining experience in Tirana, featuring traditional recipes passed down through generations and served in an environment that celebrates Albanian culture. The restaurant's décor includes traditional Albanian artifacts, and they regularly host live folk music performances. Their menu focuses on regional specialties from all parts of Albania, offering visitors a comprehensive taste of the country's culinary heritage.",
        "keyFeatures": [
          "Authentic Albanian - Traditional recipes and cultural experience",
          "Cultural Décor - Traditional Albanian artifacts and design",
          "Live Folk Music - Regular traditional music performances",
          "Regional Specialties - Dishes from all parts of Albania",
          "Cultural Education - Menu includes dish history and significance"
        ],
        "visitingInfo": "Open daily 12:00-24:00. Folk music performances Friday-Saturday evenings. English explanations of traditional dishes available. Reservations recommended for cultural nights.",
        "bestTimeToVisit": "Friday-Saturday evenings (20:00-22:00) for live folk music. Lunch (13:00-15:00) for peaceful cultural dining.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Oda+Traditional+Albanian+Restaurant+Tirana"
      },
      {
        "id": "bati-restaurant",
        "name": "Bati Restaurant 1",
        "shortDescription": "Seafood specialist offering fresh fish and traditional Albanian coastal dishes at excellent prices with harbor atmosphere.",
        "location": "Near Artificial Lake, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/bati_restaurant_1.webp",
        "type": "restaurant",
        "detailedDescription": "Bati Restaurant 1 specializes in fresh seafood and traditional Albanian coastal cuisine, bringing the flavors of Albania's beautiful coastline to Tirana. Located near the Artificial Lake, the restaurant creates a harbor-like atmosphere while maintaining excellent prices for high-quality seafood. Their daily fresh fish selection and traditional preparation methods make it a favorite among seafood enthusiasts and those seeking authentic coastal Albanian flavors.",
        "keyFeatures": [
          "Seafood Specialist - Fresh fish and coastal Albanian dishes",
          "Excellent Prices - High quality at affordable rates",
          "Harbor Atmosphere - Nautical décor and lakeside location",
          "Daily Fresh Selection - Fish and seafood delivered daily",
          "Coastal Traditions - Authentic Albanian seaside cooking methods"
        ],
        "visitingInfo": "Open daily 11:00-23:00. Daily fresh fish selection varies. Located near Artificial Lake with parking available. Popular lunch spot for seafood lovers.",
        "bestTimeToVisit": "Lunch hours (12:00-15:00) for freshest fish selection. Evening (18:00-20:00) for lakeside atmosphere.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Bati+Restaurant+1+Tirana+Albania"
      },
      {
        "id": "mullixhiu",
        "name": "Mullixhiu",
        "shortDescription": "Award-winning fine dining restaurant showcasing modern Albanian cuisine with foraged ingredients and innovative techniques.",
        "location": "Rruga Pjeter Budi, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/mullixhiu.webp",
        "type": "restaurant",
        "detailedDescription": "Mullixhiu represents the pinnacle of Albanian culinary innovation, led by renowned chef Bledar Kola who combines traditional Albanian ingredients with modern cooking techniques. The restaurant focuses on foraged ingredients, local sourcing, and creative presentations that tell the story of Albanian terroir. This award-winning establishment has gained international recognition for elevating Albanian cuisine to fine dining standards.",
        "keyFeatures": [
          "Award-Winning Chef - Internationally recognized culinary excellence",
          "Foraged Ingredients - Wild herbs and plants from Albanian mountains",
          "Modern Albanian Cuisine - Innovative techniques with traditional ingredients",
          "Local Sourcing - Supporting Albanian farmers and producers",
          "Fine Dining Experience - Artistic presentation and professional service"
        ],
        "visitingInfo": "Open Wednesday-Sunday 19:00-23:00, closed Monday-Tuesday. Reservations essential, often booked weeks in advance. Tasting menu format. Higher price point for fine dining experience.",
        "bestTimeToVisit": "Dinner service (19:00-21:00) for full tasting menu experience. Special occasion dinners and celebrations.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Mullixhiu+restaurant+Tirana+Albania"
      },
      {
        "id": "padam-boutique",
        "name": "Padam Boutique Restaurant",
        "shortDescription": "Intimate boutique restaurant offering Mediterranean fusion cuisine with emphasis on fresh seafood and seasonal ingredients.",
        "location": "Rruga Sulejman Delvina, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/padam.jpg",
        "type": "restaurant",
        "detailedDescription": "Padam Boutique Restaurant creates an intimate dining experience with Mediterranean fusion cuisine that emphasizes fresh seafood and seasonal ingredients. The small, elegantly designed space provides personalized service and allows the kitchen to focus on quality over quantity. Their menu changes regularly based on seasonal availability and chef inspiration, ensuring each visit offers something new.",
        "keyFeatures": [
          "Boutique Experience - Intimate setting with personalized service",
          "Mediterranean Fusion - Creative combinations of regional flavors",
          "Fresh Seafood Focus - Daily selection of premium fish and shellfish",
          "Seasonal Menu - Regular changes based on ingredient availability",
          "Quality over Quantity - Small space allowing focus on excellence"
        ],
        "visitingInfo": "Open Tuesday-Saturday 18:00-23:00, closed Sunday-Monday. Limited seating - reservations required. Menu changes seasonally. Wine pairings available.",
        "bestTimeToVisit": "Early dinner (18:00-20:00) for intimate atmosphere. Special occasions requiring personalized attention.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Padam+Boutique+Restaurant+Tirana+Albania"
      },
      {
        "id": "serendipity-restaurant",
        "name": "Serendipity Restaurant",
        "shortDescription": "Romantic fine dining restaurant specializing in Mexican cuisine with Albanian influences and extensive drinks selection.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/serendipity.webp",
        "type": "restaurant",
        "detailedDescription": "Serendipity Restaurant creates relaxed dining experiences through carefully crafted Mexican cuisine with subtle Albanian influences. The warm interior features soft lighting, comfortable seating, and an atmosphere designed for intimate conversations and special occasions. Their extensive wine selection includes both international favorites and premium Albanian wines, curated to complement their refined menu.",
        "keyFeatures": [
          "Relaxed Atmosphere - Intimate lighting and elegant design",
          "Mexican Cuisine - Classic techniques with Albanian touches",
          "Extensive Wine List - International and premium Albanian selections",
          "Special Occasions - Perfect for anniversaries and celebrations",
          "Professional Service - Attentive staff trained in fine dining standards"
        ],
        "visitingInfo": "Open daily 18:00-24:00. Reservations recommended for weekend dinners.Dress code:casual.",
        "bestTimeToVisit": "Quick lunch (12:00-15:00) Dinner time (19:00-21:00).",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Serendipity+Restaurant+Tirana+Albania"
      },
      {
        "id": "salt-restaurant",
        "name": "Salt Restaurant",
        "shortDescription": "Contemporary steakhouse and grill specializing in premium cuts, innovative sides, and sophisticated meat-focused dining.",
        "location": "Rruga e Kavajës, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/salt.webp",
        "type": "restaurant",
        "detailedDescription": "Salt Restaurant elevates the steakhouse concept with contemporary design and innovative approaches to meat-focused dining. They source premium cuts from both local and international suppliers, preparing them using both traditional grilling techniques and modern cooking methods. The restaurant's sophisticated atmosphere and expert preparation make it a destination for serious meat enthusiasts and special occasions.",
        "keyFeatures": [
          "Premium Steaks - High-quality local and imported cuts",
          "Contemporary Design - Modern steakhouse aesthetics",
          "Expert Preparation - Traditional and modern cooking techniques",
          "Innovative Sides - Creative accompaniments to complement meats",
          "Sophisticated Atmosphere - Upscale dining environment"
        ],
        "visitingInfo": "Open daily 17:00-24:00. Reservations recommended for prime dinner hours. Premium price point for quality cuts. Wine list focused on bold reds.",
        "bestTimeToVisit": "Dinner service (19:00-22:00) for full steakhouse experience. Business dinners and celebrations.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Salt+Restaurant+Tirana+Albania"
      },
      {
        "id": "ceren-ismet-shehu",
        "name": "Ceren Ismet Shehu",
        "shortDescription": "Authentic traditional Albanian restaurant in Tirana Castle offering fixed-menu experiences with local dishes and mountain views.",
        "location": "Rruga Murat Toptani, Tirana Castle",
        "imageUrl": "https://assets.albaniatravelcompanion.com/ceren_ismet_shehu.jpg",
        "type": "restaurant",
        "detailedDescription": "Ceren Ismet Shehu provides a unique approach to Albanian traditional cuisine, combining authentic recipes with international culinary knowledge from chef Ismet Shehu. Located within the historic Tirana Castle, the restaurant offers a fixed-menu concept featuring small portions of various traditional Albanian dishes. The evocative atmosphere blends traditional Albanian charm with modern elements, centered around a cozy fireplace and traditional décor.",
        "keyFeatures": [
          "Historic Location - Situated within Tirana Castle walls",
          "Fixed Menu Experience - Curated selection of traditional Albanian dishes",
          "Authentic Recipes - Traditional preparation methods with expert touch",
          "Traditional Atmosphere - Cozy fireplace and authentic Albanian décor",
          "Cultural Education - Showcase of local dishes made with authentic produce"
        ],
        "visitingInfo": "Open daily with set menu at approximately 2800 Lek per person. Reservations recommended. Traditional Albanian menu with vegetarian options available.",
        "bestTimeToVisit": "Lunch (13:00-15:00) for peaceful traditional dining. Dinner (19:00-21:00) for cozy fireplace atmosphere.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Ceren+Ismet+Shehu+Tirana+Castle+Albania"
      },
      {
        "id": "tribe-urban-gastronomy",
        "name": "Tribe Urban Gastronomy",
        "shortDescription": "Premium steakhouse in the heart of Tirana featuring dry-aged meats, sophisticated atmosphere, and expert preparation.",
        "location": "Rr. Murat Toptani, Pedonale Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/tribe_urban_gastronomy.jpg",
        "type": "restaurant",
        "detailedDescription": "Tribe Urban Gastronomy represents the pinnacle of steakhouse dining in Tirana, offering European, Mediterranean, and barbecue cuisine with a focus on premium meat. Their carefully selected meat comes from the best local farms and is prepared using dry-aged standards in a specially built room. The restaurant features an impressive dry-aged cabinet, wine cellar, and tribal music atmosphere with a central firepit, creating a unique dining experience for meat enthusiasts.",
        "keyFeatures": [
          "Premium Steakhouse - Best quality meat from selected local farms",
          "Dry-Aged Excellence - Specially built room for proper aging process",
          "Impressive Wine Cellar - Extensive selection to complement meats",
          "Central Location - Stone's throw from Tirana's main attractions",
          "Unique Atmosphere - Tribal music and firepit create distinctive ambiance"
        ],
        "visitingInfo": "Open daily 12:00-23:00. Reservations recommended. Premium price range ALL 870-2,200. Outdoor seating available. Phone: +355 68 609 1664.",
        "bestTimeToVisit": "Dinner service (19:00-22:00) for full steakhouse experience. Special occasions and business dinners.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Tribe+Urban+Gastronomy+Tirana+Albania"
      },
      {
        "id": "el-gaucho-tirana",
        "name": "El Gaucho Tirana",
        "shortDescription": "First Argentinian restaurant in Albania specializing in premium Black Angus beef and authentic Argentine cuisine.",
        "location": "Rruga Mustafa Qosja, near Dinamo Stadium, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/el_gaucho_tirana.jpg",
        "type": "restaurant",
        "detailedDescription": "El Gaucho Tirana brings authentic Argentine steakhouse culture to Albania, featuring the world's best quality Argentinian Black Angus beef from hand-selected farms. As the first Argentinian restaurant in Albania, it offers specialty dishes originated from Argentina, including unique Bison meat prepared by an Argentine chef. The restaurant's contemporary global influence is strongly rooted in modern Argentine culinary traditions, located in a characteristic neighborhood chosen for its vegetation and calmness.",
        "keyFeatures": [
          "Authentic Argentine - First Argentinian restaurant in Albania",
          "Premium Black Angus - Imported beef from hand-selected Argentine farms",
          "Expert Argentine Chef - Authentic preparation methods and techniques",
          "Unique Offerings - Only place to find Bison meat in Tirana",
          "Sommelier Selection - Wine selection by Sommelier Fation Tila"
        ],
        "visitingInfo": "Located in characteristic neighborhood near Dinamo Stadium. Rated 4.7 out of 5. Reservations recommended for premium Argentine dining experience.",
        "bestTimeToVisit": "Dinner service (19:00-22:00) for full Argentine steakhouse experience. Perfect for special occasions and steak lovers.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=El+Gaucho+Tirana+Albania"
      },
      {
        "id": "ulliri-restaurant",
        "name": "Ulliri Restaurant",
        "shortDescription": "Gourmet Mediterranean restaurant with multiple locations offering wood-fired pizza, quality steaks, and fine dining experience.",
        "location": "TEG Shopping Center & City Center locations, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/ulliri_restaurant.jpg",
        "type": "restaurant",
        "detailedDescription": "Ulliri Restaurant operates two prestigious locations in Tirana, offering gourmet Mediterranean cuisine and top-quality meats in both casual and fine dining settings. Their TEG location sits within Albania's biggest commercial center, while the City Center location is adjacent to Scanderbeg Square. Both locations feature Italian-style wood oven pizzas, premium steaks, and Mediterranean specialties, providing exquisite fine-dining experiences with efficient service and moderate pricing.",
        "keyFeatures": [
          "Multiple Prime Locations - TEG Shopping Center and City Center",
          "Wood Oven Pizza - Italian-style wood-fired pizza preparation",
          "Mediterranean Cuisine - Gourmet dishes and top-quality meats",
          "Fine Dining Standards - Exquisite presentation and professional service",
          "Moderate Pricing - High-quality dining at reasonable prices"
        ],
        "visitingInfo": "TEG: +355 68 699 9999, City Center: Adjacent to Scanderbeg Square. Rated 4.1-4.5 out of 5. Moderate pricing for fine dining quality.",
        "bestTimeToVisit": "Lunch (12:00-15:00) for business dining. Dinner (19:00-22:00) for fine dining experience and full ambiance.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Ulliri+Restaurant+Tirana+Albania"
      },
      {
        "id": "saporita-pizzeria",
        "name": "Saporita Pizzeria",
        "shortDescription": "Family-owned authentic Italian pizzeria near Dinamo Stadium offering Milan-style pizza with fresh ingredients since 2011.",
        "location": "Rruga Emin Duraku, near Dinamo Stadium, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/saporita_pizzeria.jpg",
        "type": "restaurant",
        "detailedDescription": "Saporita Pizzeria is a beloved family-owned establishment that has been serving authentic Italian pizza since 2011. Located near Dinamo Stadium, this pizzeria offers Milan-style pizza with perfectly thin and crispy crusts, high-quality mozzarella, and rich, flavorful toppings made with the freshest ingredients. Known for maintaining the same taste as pizza in Italy, Saporita has earned a reputation as one of the best pizzerias in Tirana with excellent price-to-quality ratio.",
        "keyFeatures": [
          "Authentic Italian - Same taste as pizza in Italy with traditional recipes",
          "Milan-Style Pizza - Thin, crispy crusts with premium toppings",
          "Family-Owned - Operating since 2011 with consistent quality",
          "Fresh Ingredients - Daily preparation with high-quality mozzarella",
          "Excellent Value - Fair pricing around 5-6 euros per pizza"
        ],
        "visitingInfo": "Open daily with takeout, dine-in, and outdoor seating. Phone: +355 67 234 8520. Email: pizzerita_saporita@hotmail.com. Rated 4.2-4.4 out of 5.",
        "bestTimeToVisit": "Lunch (12:00-15:00) for quick authentic pizza. Dinner (19:00-22:00) for full Italian dining experience.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Saporita+Pizzeria+Tirana+Albania"
      },
      {
        "id": "pizzarte-tirana",
        "name": "PizzArte Tirana",
        "shortDescription": "Authentic Neapolitan-style pizzeria in city center offering wood-fired pizzas with traditional techniques and cozy atmosphere.",
        "location": "Rruga Luigj Gurakuqi, Tirana Center",
        "imageUrl": "https://assets.albaniatravelcompanion.com/pizzarte_tirana.jpeg",
        "type": "restaurant",
        "detailedDescription": "PizzArte represents authentic Neapolitan pizza culture in the heart of Tirana, specializing in traditional wood-fired pizzas baked to perfection. The restaurant features simple yet cozy interior design with warm ambiance, focusing on the art of authentic Neapolitan pizza making. Their commitment to traditional techniques, quality ingredients, and proper wood-fired cooking methods has earned them recognition as one of Tirana's top pizza destinations.",
        "keyFeatures": [
          "Authentic Neapolitan - Traditional wood-fired pizza preparation",
          "Quality Ingredients - Fresh, high-quality toppings and dough",
          "Central Location - Heart of Tirana for easy access",
          "Cozy Atmosphere - Simple design with warm, welcoming ambiance",
          "Traditional Techniques - Proper Neapolitan pizza making methods"
        ],
        "visitingInfo": "Located in Tirana center, phone: +355 696 826 287. Price range ALL 280-920. Delivery available through Wolt. Rated 4.5 out of 5.",
        "bestTimeToVisit": "Lunch (12:00-15:00) for fresh Neapolitan pizza. Dinner (19:00-21:00) for cozy atmosphere and full menu experience.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=PizzArte+Tirana+Albania"
      },
      {
        "id": "mrizi-zanave-fishte",
        "name": "Mrizi i Zanave (Fishtë)",
        "shortDescription": "Albania's most famous agrotourism restaurant offering slow food farm-to-table dining with local wines and traditional Albanian cuisine.",
        "location": "Fishtë, Lezhe County",
        "imageUrl": "https://assets.albaniatravelcompanion.com/mrizi_i_zanave_fisht.jpg",
        "type": "agroturizem",
        "detailedDescription": "Mrizi i Zanave (The Old Mill) is arguably Albania's most renowned agrotourism destination, embodying the 'Think Globally, Eat Locally' philosophy. Located in the farming village of Fishtë in northwestern Albania, this establishment combines resort, restaurant, farm, winery, and production facility. Known for serving some of the tastiest food in the Balkans, they offer fresh, organic farm-to-table Albanian slow-food complemented by their own wine production. The restaurant collaborates with many local farming families and employs about 70 people, making it a cornerstone of the local economy.",
        "keyFeatures": [
          "Farm-to-Table Philosophy - Fresh, organic ingredients sourced locally",
          "On-site Wine Production - House wines made from local grapes",
          "Cheese Production - Fresh cheese, marmalades, and aged cheese in wine barrels",
          "Slow Food Movement - Traditional Albanian cooking methods",
          "Community Support - Collaborates with 70+ local farming families",
          "Multi-purpose Facility - Restaurant, farm, winery, and accommodation"
        ],
        "visitingInfo": "Reservations required 1 week in advance. Avoid 3-5PM transition period. Seasonal menu changes 4 times yearly. Traditional Albanian recipes with modern techniques.",
        "bestTimeToVisit": "Lunch (12:00-15:00) for farm-fresh experience. Early dinner (18:00-20:00) for wine pairings. Avoid 15:00-17:00 kitchen transition.",
        "mapsUrl": "https://images.myguide-cdn.com/albania/companies/mrizi-i-zanave/large/mrizi-i-zanave-1206196.jpg"
      },
      {
        "id": "mrizi-zanave-tirana",
        "name": "Mrizi i Zanave (Tirana)",
        "shortDescription": "City location of Albania's famous agrotourism restaurant, bringing farm-to-table slow food philosophy to Tirana's center.",
        "location": "Next to Ura e Tabakeve (Tanners' Bridge), Tirana Center",
        "imageUrl": "https://assets.albaniatravelcompanion.com/mrizi_i_zanave_tirana.webp",
        "type": "agroturizem",
        "detailedDescription": "Operating since 2004, the Tirana location of Mrizi i Zanave brings the acclaimed slow food philosophy to the capital city. Located next to the historic 18th century Ura e Tabakeve monument, this restaurant maintains the same 'Think Globally, Eat Locally' motto as its original Fishtë location. The menu changes seasonally (4 times per year) featuring traditional Albanian recipes enhanced with modern cooking techniques, using ingredients sourced from their partner farms.",
        "keyFeatures": [
          "Historic Location - Next to 18th century Tanners' Bridge monument",
          "Seasonal Menu - Changes 4 times yearly with fresh ingredients",
          "Slow Food Philosophy - Traditional recipes with modern techniques",
          "City Convenience - Accessible location in Tirana center",
          "Wine Selection - Curated Albanian wines including house selections",
          "Cultural Heritage - Infusing traditional Albanian recipes with innovation"
        ],
        "visitingInfo": "Phone: +355 69 210 8032. Email: info@mrizizanave.al. Reservations recommended. Rated 4.8/5 on TripAdvisor, #38 of 927 restaurants in Tirana.",
        "bestTimeToVisit": "Lunch (13:00-15:00) for business dining. Dinner (19:00-21:00) for full cultural experience. Weekend reservations essential.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Mrizi+Zanave+Tirana"
      },
      {
        "id": "alpeta-agrotourism",
        "name": "Alpeta Agrotourism & Winery",
        "shortDescription": "Award-winning family winery on TIME's World's Greatest Places 2025, offering traditional winemaking and farm-to-table dining with Mount Tomorr views.",
        "location": "Roshnik village, Berat County",
        "imageUrl": "https://assets.albaniatravelcompanion.com/alpeta_agrotourism_winery.jpg",
        "type": "agroturizem",
        "detailedDescription": "Established in 1994 by the Fiska family, Alpeta Agrotourism & Winery has gained international recognition, earning a spot on TIME's World's Greatest Places 2025 list. Located in scenic Roshnik village with views of Mount Tomorr, vineyards, and lakes, this family-owned establishment offers traditional winemaking techniques with local Pules and Shesh grapes alongside Cabernet and Merlot. Their wines have earned medals at the Decanter World Wine Awards, while their restaurant celebrates traditional Albanian cuisine with locally-sourced ingredients and recipes passed down from grandmothers.",
        "keyFeatures": [
          "TIME Recognition - World's Greatest Places 2025",
          "Award-winning Wines - Decanter World Wine Awards medals",
          "Family Tradition - 30+ years of vineyard cultivation by Fiska family",
          "Scenic Location - Mount Tomorr views surrounded by vineyards",
          "Traditional Winemaking - Local grape varieties and time-honored methods",
          "Heritage Recipes - Grandmother's recipes with locally-sourced ingredients"
        ],
        "visitingInfo": "Accommodation: €10 per bed, €30 double room. Restaurant serves vegetarian, vegan, gluten-free options. Free WiFi, parking. 24-hour front desk.",
        "bestTimeToVisit": "Harvest season (September) for grape picking experience. Sunset dinner (18:00-20:00) for mountain views. Wine tasting tours available daily.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Alpeta+Agrotourism+Winery+Roshnik+Berat+Albania"
      },
      {
        "id": "agroturizem-gjepali",
        "name": "Agroturizem Gjepali",
        "shortDescription": "Family-owned agrotourism business in Gjepalaj village offering hands-on culinary experiences including bread making, cheese making, and traditional Albanian cuisine.",
        "location": "Gjepalaj village, Shijak-Durres",
        "imageUrl": "https://assets.albaniatravelcompanion.com/agroturizem_gjepali.jpg",
        "type": "agroturizem",
        "detailedDescription": "Agroturizem Gjepali is a family-owned business located in Gjepalaj village, created by an owner who became a kitchen chef and wanted to share authentic Albanian culinary traditions. This hands-on agrotourism experience allows guests to participate in traditional food preparation methods, including bread making, cheese making, and jam making. The menu features traditional Albanian cuisine prepared with local ingredients, offering visitors an immersive cultural experience that goes beyond dining to include learning traditional cooking techniques.",
        "keyFeatures": [
          "Hands-on Experiences - Bread making, cheese making, jam making",
          "Family-owned Business - Personal attention and authentic hospitality",
          "Traditional Albanian Cuisine - Local ingredients and time-honored recipes",
          "Culinary Education - Learn traditional cooking techniques",
          "Village Setting - Authentic rural Albanian environment",
          "Interactive Dining - Participate in meal preparation process"
        ],
        "visitingInfo": "Hands-on culinary workshops available. Traditional Albanian menu with local ingredients. Advance booking recommended for workshop experiences.",
        "bestTimeToVisit": "Morning workshops (9:00-12:00) for bread and cheese making. Lunch (12:00-15:00) to enjoy self-made products.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Agroturizem+Gjepali+Gjepalaj+Shijak+Durres+Albania"
      },
      {
        "id": "farma-sotira",
        "name": "Farma Sotira",
        "shortDescription": "Pine forest agrotourism farm offering wood-oven baked bread, fresh feta cheese, and on-site wine production with horseback riding experiences.",
        "location": "Surrounded by pine forests and natural lakes",
        "imageUrl": "https://assets.albaniatravelcompanion.com/farma_sotira.jpg",
        "type": "agroturizem",
        "detailedDescription": "Farma Sotira offers a unique agrotourism experience surrounded by pine tree forests, wild meadows, and natural lakes. Every meal includes their signature wood oven-baked bread, fresh feta cheese, and wine made from grapes grown directly on site. The farm provides opportunities for guests to participate in grape harvesting in September for wine and raki production. With 10 miles of private countryside, the farm also offers horseback riding experiences, making it a complete rural retreat that combines culinary traditions with outdoor activities.",
        "keyFeatures": [
          "Natural Setting - Pine forests, meadows, and natural lakes",
          "Wood Oven Bread - Traditional baking methods with fresh daily bread",
          "On-site Wine Production - Grapes grown and processed on property",
          "Fresh Feta Cheese - Made daily with traditional methods",
          "Horseback Riding - 10 miles of private countryside trails",
          "Seasonal Activities - Grape harvesting in September for wine and raki"
        ],
        "visitingInfo": "Grape harvesting experiences in September. Horseback riding available with 10 miles of private trails. Wood oven-baked bread and fresh feta at every meal.",
        "bestTimeToVisit": "September for grape harvest experience. Spring/summer (May-August) for horseback riding and outdoor activities. Morning (8:00-10:00) for fresh bread.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Farma+Sotira+Albania+agrotourism"
      },
      {
        "id": "uka-farm",
        "name": "UKA Farm",
        "shortDescription": "Organic poly-cultural farm with native Albanian wine varieties and farm-to-table restaurant serving pesticide-free, locally-sourced dishes.",
        "location": "Rural Albania",
        "imageUrl": "https://assets.albaniatravelcompanion.com/uka_farm.jpg",
        "type": "agroturizem",
        "detailedDescription": "UKA Farm represents a comprehensive approach to sustainable Albanian agriculture, operating as a poly-cultural agricultural farm with completely organic, pesticide-free production methods. The farm features a winery that produces native Albanian wine from local grape cultivars, preserving traditional Albanian winemaking heritage. Their restaurant operates on a true farm-to-table concept, with all dishes prepared using ingredients grown on the property or sourced from local organic farmers, ensuring the freshest and most authentic Albanian flavors.",
        "keyFeatures": [
          "Poly-cultural Agriculture - Diverse organic farming methods",
          "Pesticide-free Production - Completely organic growing practices",
          "Native Albanian Wines - Traditional grape cultivars and winemaking",
          "Farm-to-table Restaurant - Ingredients grown on-site",
          "Sustainable Practices - Environmental responsibility and conservation",
          "Local Grape Cultivars - Preserving Albanian wine heritage"
        ],
        "visitingInfo": "All products organic and pesticide-free. Native Albanian wine tastings available. Farm-to-table dining with on-site grown ingredients.",
        "bestTimeToVisit": "Harvest season (September-October) for wine production. Summer (June-August) for diverse crop availability. Wine tastings year-round.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=UKA+Farm+Albania+agrotourism"
      }
    ],
    "bars": [
      {
        "id": "hemingway-bar",
        "name": "Hemingway Bar",
        "shortDescription": "Literary-themed cocktail bar on Rruga Kont Urani offering classic cocktails in a sophisticated writer's atmosphere.",
        "location": "Rruga Kont Urani, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/hemingway.webp",
        "type": "cocktail",
        "detailedDescription": "Hemingway Bar pays homage to the legendary American writer with a sophisticated atmosphere filled with literary references and classic cocktail traditions. Located on Rruga Kont Urani, this intimate bar specializes in timeless cocktail recipes that Hemingway himself might have enjoyed. The décor features vintage books, classic furniture, and an ambiance that encourages conversation and contemplation over expertly crafted drinks.",
        "keyFeatures": [
          "Literary Theme - Hemingway-inspired décor and atmosphere",
          "Classic Cocktails - Traditional recipes and expert preparation",
          "Intimate Setting - Perfect for conversation and relaxation",
          "Book Collection - Vintage literature and writing memorabilia",
          "Cultural Atmosphere - Appeals to intellectuals and book lovers"
        ],
        "visitingInfo": "Open Tuesday-Saturday 19:00-02:00, closed Sunday-Monday. Limited seating - reservations recommended. Cash and cards accepted. Quiet, conversation-friendly environment.",
        "bestTimeToVisit": "Early evening (19:00-21:00) for intimate atmosphere. Late night (22:00-24:00) for literary discussions and classic cocktails.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Hemingway+Bar+Rruga+Kont+Urani+Tirana+Albania"
      },
      {
        "id": "colonial-cocktails",
        "name": "Colonial Cocktails",
        "shortDescription": "Educational cocktail bar offering mixology classes, premium drinks, and interactive bartending experiences.",
        "location": "City Center, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/colonial.webp",
        "type": "cocktail",
        "detailedDescription": "Colonial Cocktails Academy Tirana combines exceptional cocktail service with educational experiences, offering both expertly crafted drinks and hands-on mixology classes. This unique establishment features colonial-era décor and teaches the history and technique behind classic cocktails. Visitors can enjoy premium drinks while learning about spirits, techniques, and cocktail culture from professional instructors.",
        "keyFeatures": [
          "Mixology Classes - Hands-on cocktail making instruction",
          "Educational Experience - Learn cocktail history and techniques",
          "Colonial Theme - Historical décor and atmosphere",
          "Professional Instruction - Expert bartenders as teachers",
          "Interactive Experience - Participatory cocktail creation"
        ],
        "visitingInfo": "Open Wednesday-Sunday 18:00-01:00. Mixology classes require advance booking. Higher price point for educational experience. Group classes available for events.",
        "bestTimeToVisit": "Class times (18:00-20:00) for educational experience. Evening service (20:00-23:00) for cocktails after classes.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Colonial+Cocktails+Academy+Tirana+Albania"
      },
      {
        "id": "nouvelle-vague",
        "name": "Nouvelle Vague Tirana",
        "shortDescription": "French-inspired cocktail bar with nouvelle vague cinema theme, offering creative drinks and artistic atmosphere.",
        "location": "Rruga e Kavajës, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/nouvelle vague.jpg",
        "type": "cocktail",
        "detailedDescription": "Nouvelle Vague Tirana draws inspiration from the French New Wave cinema movement, creating a unique cocktail experience that combines film culture with innovative mixology. The bar features black and white photography, film memorabilia, and an artistic atmosphere reminiscent of 1960s French cinema. Their cocktail menu reflects this creative spirit with innovative drinks that are both visually stunning and expertly crafted.",
        "keyFeatures": [
          "Cinema Theme - French New Wave film-inspired atmosphere",
          "Creative Cocktails - Innovative and visually artistic drinks",
          "Artistic Décor - Black and white photography and film memorabilia",
          "Cultural Experience - Blend of cinema and cocktail culture",
          "Instagram Worthy - Photogenic drinks and atmospheric setting"
        ],
        "visitingInfo": "Open Monday-Saturday 19:00-02:00, closed Sundays. Artistic atmosphere with film screenings occasionally. Creative cocktail menu changes seasonally. Popular with artists and film enthusiasts.",
        "bestTimeToVisit": "Evening (19:00-21:00) for artistic atmosphere. Late night (22:00-01:00) for creative cocktails and film discussions.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Nouvelle+Vague+Tirana+Albania"
      },
      {
        "id": "mimoza-bar",
        "name": "Mimoza Bar & Cocktails",
        "shortDescription": "Elegant cocktail lounge offering premium drinks, sophisticated atmosphere, and professional mixology service.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/mimoza_bar_cocktails.webp",
        "type": "cocktail",
        "detailedDescription": "Mimoza Bar & Cocktails represents the pinnacle of cocktail culture in Tirana, offering an elegant lounge atmosphere with expertly crafted drinks and impeccable service. The bar features a carefully curated selection of premium spirits, fresh ingredients, and classic cocktail techniques elevated to modern standards. The sophisticated interior and professional staff create an atmosphere perfect for intimate conversations and special occasions.",
        "keyFeatures": [
          "Elegant Lounge - Sophisticated interior and upscale atmosphere",
          "Premium Spirits - Carefully curated selection of top-shelf liquors",
          "Expert Mixology - Professional bartenders with advanced skills",
          "Intimate Setting - Perfect for dates and special occasions",
          "Classic Techniques - Traditional cocktail methods with modern presentation"
        ],
        "visitingInfo": "Open daily 18:00-03:00. Upscale establishment with higher prices. Reservations recommended for weekend evenings. Dress code: smart casual to formal.",
        "bestTimeToVisit": "Cocktail hour (18:00-20:00) for elegant atmosphere. Late evening (21:00-24:00) for sophisticated nightlife experience.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Mimoza+Bar+Cocktails+Tirana+Albania"
      },
      {
        "id": "sky-tower-lounge",
        "name": "Sky Tower Lounge",
        "shortDescription": "Rooftop cocktail lounge offering panoramic city views, premium spirits, and sophisticated atmosphere high above Tirana.",
        "location": "Sky Tower, Tirana Center",
        "imageUrl": "https://assets.albaniatravelcompanion.com/sky club.webp",
        "type": "cocktail",
        "detailedDescription": "Sky Tower Lounge provides Tirana's most elevated cocktail experience, literally perched high above the city with breathtaking 360-degree views. The sophisticated lounge offers premium cocktails crafted with top-shelf spirits while guests enjoy unparalleled panoramic vistas of Tirana, the surrounding mountains, and beyond. The modern interior design complements the spectacular views, creating an unforgettable atmosphere for special occasions.",
        "keyFeatures": [
          "Panoramic Views - 360-degree vistas of Tirana and mountains",
          "High-Altitude Experience - Elevated above the city skyline",
          "Premium Cocktails - Top-shelf spirits and expert mixology",
          "Modern Design - Sophisticated interior matching the views",
          "Special Occasions - Perfect for celebrations and memorable evenings"
        ],
        "visitingInfo": "Open daily 17:00-02:00. Elevator access to upper floors. Reservations recommended for window seating. Higher price point for premium location and views.",
        "bestTimeToVisit": "Sunset hours (18:00-20:00) for spectacular views. Clear evenings for optimal visibility and city lights.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Sky+Tower+Lounge+Tirana+Albania"
      },
      {
        "id": "radio-bar",
        "name": "Radio Bar Tirana",
        "shortDescription": "Retro-themed bar with vintage music equipment, craft cocktails, and nostalgic atmosphere celebrating radio culture.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/radio_bar_tirana.jpg",
        "type": "bar",
        "detailedDescription": "Radio Bar Tirana is a unique themed establishment that pays homage to the golden age of radio broadcasting. The bar features vintage radio equipment, retro furniture, and a carefully curated playlist that spans decades of music history. Known for their creative cocktails with radio-inspired names and a warm, nostalgic atmosphere that attracts both locals and music enthusiasts.",
        "keyFeatures": [
          "Vintage Theme - Authentic radio equipment and retro décor",
          "Music Focus - Curated playlists spanning multiple decades",
          "Creative Cocktails - Radio-themed drink names and presentations",
          "Nostalgic Atmosphere - Warm, cozy environment",
          "Local Favorite - Popular with Tirana's creative community"
        ],
        "visitingInfo": "Open Monday-Saturday 18:00-02:00, closed Sundays. Cash and cards accepted. Limited seating - arrive early on weekends. Live DJ sets on weekends.",
        "bestTimeToVisit": "Early evening (18:00-20:00) for quieter atmosphere and conversation. Weekend nights (22:00-24:00) for full energy and music.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Radio+Bar+Tirana+Albania"
      },
      {
        "id": "kino-bar",
        "name": "KINO",
        "shortDescription": "Cinema-themed cocktail bar featuring film memorabilia, craft drinks, and screenings in a vintage movie theater setting.",
        "location": "Rruga Abdyl Frashëri, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/kino.webp",
        "type": "bar",
        "detailedDescription": "KINO transforms the classic movie theater experience into an innovative cocktail bar. The venue features authentic cinema seating, vintage film equipment, and movie memorabilia from Albanian and international cinema. Their cocktail menu is inspired by classic films, and they regularly host film screenings, creating a unique entertainment experience that combines drinks with cinema culture.",
        "keyFeatures": [
          "Cinema Theme - Authentic movie theater seating and décor",
          "Film-Inspired Cocktails - Drinks named after classic movies",
          "Movie Screenings - Regular film events and premieres",
          "Vintage Equipment - Original cinema projection equipment",
          "Cultural Hub - Supporting Albanian and international cinema"
        ],
        "visitingInfo": "Open Tuesday-Sunday 19:00-02:00, closed Mondays. Film screening schedule available online. Cocktail service during screenings. Reservations recommended for special events.",
        "bestTimeToVisit": "Film screening nights for full experience. Weekend evenings (20:00-22:00) for cocktails and cinema atmosphere.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=KINO+bar+Tirana+Albania"
      },
      {
        "id": "komiteti-bar",
        "name": "Komiteti Bar - Tiranë",
        "shortDescription": "Historic communist-era themed bar serving traditional Albanian raki and creating an authentic socialist atmosphere.",
        "location": "Rruga Pjeter Budi, Tirana Old Town",
        "imageUrl": "https://assets.albaniatravelcompanion.com/komiteti_bar___tiran.jpg",
        "type": "bar",
        "detailedDescription": "Komiteti Bar offers a fascinating journey into Albania's communist past, housed in an authentic setting with original propaganda posters, vintage furniture, and historical artifacts. The bar specializes in traditional Albanian raki and local spirits, providing visitors with both cultural education and quality drinks. This unique establishment has become a must-visit for those interested in Albanian history and culture.",
        "keyFeatures": [
          "Historical Theme - Authentic communist-era décor and artifacts",
          "Traditional Spirits - Extensive raki and local alcohol selection",
          "Cultural Experience - Educational insight into Albanian history",
          "Authentic Setting - Original propaganda and vintage items",
          "Tourist Attraction - Popular with visitors seeking unique experiences"
        ],
        "visitingInfo": "Open daily 18:00-01:00. Cash preferred. English-speaking staff available. Historical explanations provided. Popular with tour groups - expect crowds.",
        "bestTimeToVisit": "Early evening (18:00-20:00) for cultural discussion and history. Later evening (21:00-23:00) for authentic Albanian drinking culture.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Komiteti+Bar+Tirana+Albania"
      },
      {
        "id": "soma-vinyl",
        "name": "Soma Vinyl Station",
        "shortDescription": "Record store and bar combination featuring extensive vinyl collection, craft beers, and live music performances.",
        "location": "Rruga e Kavajës, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/soma_vinyl_station.jpg",
        "type": "bar",
        "detailedDescription": "Soma Vinyl Station uniquely combines a record store with a bar, creating a haven for music lovers and vinyl enthusiasts. The venue features an extensive collection of vinyl records spanning all genres, craft beer selection, and regular live acoustic performances. The atmosphere encourages music discovery, with customers able to browse records while enjoying drinks and often purchasing albums from their evening's playlist.",
        "keyFeatures": [
          "Vinyl Collection - Extensive record store with rare finds",
          "Music Discovery - Listen before you buy concept",
          "Craft Beer Focus - Curated selection of local and international beers",
          "Live Performances - Regular acoustic sets and music events",
          "Community Hub - Meeting place for Tirana's music scene"
        ],
        "visitingInfo": "Open daily 16:00-24:00. Record store and bar operate simultaneously. Live music schedule varies - check social media. Vinyl purchases can be made during bar hours.",
        "bestTimeToVisit": "Afternoon (16:00-18:00) for record browsing in quieter setting. Evening live music events typically start at 21:00.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Soma+Vinyl+Station+Tirana+Albania"
      },
      {
        "id": "spy-speakeasy",
        "name": "Spy Speakeasy",
        "shortDescription": "Hidden speakeasy bar with secret entrance, premium cocktails, and mysterious espionage-themed atmosphere.",
        "location": "Hidden location in Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/spy_speakeasy.jpg",
        "type": "bar",
        "detailedDescription": "Spy Speakeasy maintains the mystery and exclusivity of the prohibition era with its hidden entrance and secretive atmosphere. This upscale cocktail bar requires insider knowledge to find, featuring dim lighting, leather furnishings, and a menu of expertly crafted cocktails with espionage-themed names. The bartenders are skilled mixologists who create both classic and innovative drinks in an atmosphere of sophisticated intrigue.",
        "keyFeatures": [
          "Hidden Location - Secret entrance adds to mystique",
          "Premium Cocktails - Expert mixology and high-quality spirits",
          "Espionage Theme - Spy-inspired décor and drink names",
          "Exclusive Atmosphere - Limited seating and intimate setting",
          "Professional Service - Skilled bartenders and attentive staff"
        ],
        "visitingInfo": "Open Wednesday-Saturday 20:00-03:00. Reservation recommended. Higher price point. Dress code: smart casual to formal. Location details provided upon reservation.",
        "bestTimeToVisit": "Weeknight (Wednesday-Thursday) for intimate experience. Weekend nights for full atmosphere but expect crowds.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Spy+Speakeasy+Bllok+Tirana+Albania"
      },
      {
        "id": "hemingway-garden",
        "name": "Hemingway Garden Bar",
        "shortDescription": "Outdoor garden bar extension of Hemingway Bar, offering alfresco dining and drinks in green oasis setting.",
        "location": "Behind Hemingway Bar, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/hemingway_garden_bar.jpg",
        "type": "bar",
        "detailedDescription": "Hemingway Garden Bar extends the literary atmosphere of the main Hemingway Bar into a beautiful outdoor garden setting. Surrounded by lush greenery and ambient lighting, this seasonal venue offers the perfect escape from urban intensity. The garden maintains the same commitment to classic cocktails while providing a more relaxed, nature-focused environment ideal for warm evenings and intimate conversations.",
        "keyFeatures": [
          "Garden Setting - Lush outdoor space with natural ambiance",
          "Seasonal Operation - Open during warm weather months",
          "Literary Atmosphere - Extension of Hemingway Bar concept",
          "Intimate Seating - Small tables perfect for conversation",
          "Classic Cocktails - Same high-quality drinks in outdoor setting"
        ],
        "visitingInfo": "Seasonal operation April-October, weather permitting. Open daily 18:00-24:00 during season. Garden seating fills quickly - arrive early or make reservations.",
        "bestTimeToVisit": "Sunset hours (18:00-20:00) for magical garden lighting. Late spring and early autumn for perfect weather.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Hemingway+Garden+Bar+Tirana+Albania"
      }
    ],
    "bakeries-qsr": [
      {
        "id": "le-bon-tirana",
        "name": "Le Bon Tirana",
        "shortDescription": "French-style bakery offering authentic croissants, pastries, and artisanal bread with Parisian bakery standards.",
        "location": "Rruga e Kavajës, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/le_bon_tirana.jpg",
        "type": "bakery",
        "detailedDescription": "Le Bon Tirana brings authentic French bakery traditions to Albania's capital. Their team of French-trained bakers produces daily fresh croissants, pain au chocolat, and artisanal breads using traditional techniques and imported French flour. The bakery maintains strict Parisian standards, offering both classic French pastries and seasonal specialties throughout the year.",
        "keyFeatures": [
          "Authentic French Baking - Traditional techniques and recipes",
          "Daily Fresh Production - Baked fresh every morning",
          "Imported Ingredients - French flour and premium materials",
          "Seasonal Specialties - Rotating menu based on French calendar",
          "Professional Standards - French-trained baking team"
        ],
        "visitingInfo": "Open daily 7:00-19:00. Best selection available 8:00-12:00. Pre-orders accepted for special occasions. Higher price point for premium quality.",
        "bestTimeToVisit": "Early morning (7:00-9:00) for warmest, freshest pastries. Mid-morning (10:00-12:00) for full selection availability.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Le+Bon+Tirana+bakery+Albania"
      },
      {
        "id": "zio-peppe",
        "name": "Zio Peppe - Pizza al Metro",
        "shortDescription": "24/7 pizza by the meter concept just 7 minutes from the apartment, offering quick service and authentic Italian pizza.",
        "location": "7-minute walk from apartment, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/zio peppe.webp",
        "type": "qsr",
        "detailedDescription": "Zio Peppe revolutionizes pizza service with their innovative 'pizza al metro' concept, where pizzas are made in long rectangular shapes and sold by length. Open 24/7 and located just 7 minutes from the apartment, it's the perfect solution for quick, quality meals at any hour. Their authentic Italian recipes and quick service make it a local favorite for both tourists and residents.",
        "keyFeatures": [
          "24/7 Operation - Always open for convenience",
          "Pizza al Metro - Unique serving concept by length",
          "Close Location - Just 7-minute walk from apartment",
          "Quick Service - Fast preparation and minimal wait times",
          "Authentic Italian - Traditional pizza recipes and techniques"
        ],
        "visitingInfo": "Open 24/7, 365 days a year. Cash and cards accepted. No reservations needed. Popular late-night spot. Multiple pizza varieties always available.",
        "bestTimeToVisit": "Late night (22:00-02:00) when most other places are closed. Lunch hours (12:00-14:00) for quick meal option.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Zio+Peppe+pizza+al+metro+Tirana+Albania"
      },
      {
        "id": "laguna-pizza",
        "name": "Laguna Pizza & Ice Cream",
        "shortDescription": "Family-friendly establishment combining quality pizza with artisanal ice cream, perfect for casual dining.",
        "location": "Rruga Myslym Shyri, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/laguna.webp",
        "type": "qsr",
        "detailedDescription": "Laguna Pizza & Ice Cream offers the perfect combination for family dining, featuring quality pizza alongside homemade ice cream. This casual establishment has built a reputation for consistent quality, generous portions, and a welcoming atmosphere that makes it popular with both locals and families. Their ice cream selection changes seasonally, featuring both classic and innovative flavors.",
        "keyFeatures": [
          "Dual Concept - Pizza and ice cream in one location",
          "Family Friendly - Welcoming atmosphere for all ages",
          "Homemade Ice Cream - Artisanal preparation with seasonal flavors",
          "Quality Pizza - Consistent preparation and generous toppings",
          "Casual Dining - Relaxed environment for comfortable meals"
        ],
        "visitingInfo": "Open daily 11:00-23:00. Family portions available. Ice cream selection varies by season. Takeaway and delivery options available.",
        "bestTimeToVisit": "Lunch hours (12:00-14:00) for pizza. Afternoon (15:00-17:00) for ice cream. Family dinner time (18:00-20:00).",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Laguna+Pizza+Ice+Cream+Tirana+Albania"
      },
      {
        "id": "opa-greek-food",
        "name": "OPA - Greek Street Food (Bllok)",
        "shortDescription": "Authentic Greek street food spot in Bllok offering gyros, souvlaki, and traditional Greek quick-service options.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/opa.jpg",
        "type": "qsr",
        "detailedDescription": "OPA brings authentic Greek street food culture to Tirana's trendy Bllok area. Specializing in traditional gyros, souvlaki, and Greek wraps, the restaurant uses imported Greek ingredients and traditional preparation methods. The casual, energetic atmosphere reflects genuine Greek taverna culture, making it a popular spot for quick, satisfying meals with Mediterranean flair.",
        "keyFeatures": [
          "Authentic Greek Food - Traditional recipes and imported ingredients",
          "Street Food Focus - Quick service, casual dining experience",
          "Bllok Location - Heart of Tirana's trendy district",
          "Mediterranean Flavors - Fresh herbs, olive oil, and quality meats",
          "Energetic Atmosphere - Lively Greek taverna vibe"
        ],
        "visitingInfo": "Open daily 11:00-24:00. No reservations needed. Popular lunch and late-night spot. Takeaway available. Greek music and atmosphere.",
        "bestTimeToVisit": "Lunch hours (12:00-15:00) for quick meals. Evening (19:00-21:00) for authentic Greek dining experience.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=OPA+Greek+Street+Food+Bllok+Tirana+Albania"
      },
      {
        "id": "te-met-kodra",
        "name": "Te Met Kodra",
        "shortDescription": "Traditional Albanian fast food specializing in local quick-service dishes with authentic flavors and affordable prices.",
        "location": "Various locations, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/met kodra.webp",
        "type": "qsr",
        "detailedDescription": "Te Met Kodra represents authentic Albanian fast food culture, offering traditional quick-service dishes that locals have enjoyed for generations. Their menu features byrek (Albanian pastry), qofte (meatballs), and other traditional dishes prepared quickly but maintaining authentic flavors. This local chain provides an affordable way to experience genuine Albanian cuisine in a casual setting.",
        "keyFeatures": [
          "Traditional Albanian - Authentic local fast food culture",
          "Affordable Prices - Budget-friendly options for daily meals",
          "Quick Service - Fast preparation maintaining quality",
          "Local Favorites - Byrek, qofte, and traditional dishes",
          "Multiple Locations - Convenient access throughout Tirana"
        ],
        "visitingInfo": "Open daily 7:00-22:00. Very affordable prices. Cash preferred. No English menu but staff often speaks basic English. Popular with locals.",
        "bestTimeToVisit": "Breakfast time (7:00-10:00) for fresh byrek. Lunch hours (12:00-14:00) for traditional Albanian quick meals.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Te+Met+Kodra+Tirana+Albania"
      },
      {
        "id": "morsi-tirana",
        "name": "Morsi Tirana (Bllok)",
        "shortDescription": "Modern quick-service restaurant in Bllok offering fresh sandwiches, salads, and healthy fast-casual options.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/morsi_tirana_bllok.webp",
        "type": "qsr",
        "detailedDescription": "Morsi Tirana brings modern fast-casual dining to the Bllok area, focusing on fresh, healthy options without sacrificing speed or convenience. Their menu features gourmet sandwiches, fresh salads, and innovative wraps made with high-quality ingredients. The contemporary design and efficient service model appeal to young professionals and health-conscious diners looking for quick, nutritious meals.",
        "keyFeatures": [
          "Healthy Fast-Casual - Fresh ingredients and nutritious options",
          "Gourmet Sandwiches - Creative combinations and quality meats",
          "Modern Design - Contemporary interior and efficient layout",
          "Bllok Location - Convenient spot in trendy district",
          "Quick Service - Fast preparation without compromising quality"
        ],
        "visitingInfo": "Open Monday-Saturday 8:00-22:00, Sunday 10:00-20:00. Cards and cash accepted. Healthy options clearly marked. Popular lunch spot for office workers.",
        "bestTimeToVisit": "Lunch hours (12:00-14:00) for business lunch crowd. Afternoon (15:00-17:00) for quieter service.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Morsi+Tirana+Bllok+Albania"
      },
      {
        "id": "haburger",
        "name": "Haburger",
        "shortDescription": "Gourmet burger joint offering premium beef patties, creative toppings, and artisanal burger creations.",
        "location": "Rruga e Kavajës, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/haburger.webp",
        "type": "qsr",
        "detailedDescription": "Haburger elevates the burger experience in Tirana with premium beef patties, artisanal buns, and creative topping combinations. This gourmet burger joint focuses on quality ingredients, including locally sourced beef and imported specialty items. Their menu balances classic American burger styles with innovative creations that reflect local tastes and international influences.",
        "keyFeatures": [
          "Premium Beef - High-quality, locally sourced meat",
          "Artisanal Buns - Freshly baked daily for perfect texture",
          "Creative Toppings - Innovative combinations and local influences",
          "Gourmet Quality - Restaurant-level ingredients in fast-casual format",
          "American Style - Classic burger culture with modern execution"
        ],
        "visitingInfo": "Open daily 11:00-23:00. Made-to-order preparation may take 10-15 minutes. Higher price point for premium quality. Delivery available.",
        "bestTimeToVisit": "Lunch hours (12:00-14:00) for fresh preparation. Dinner time (19:00-21:00) for full menu experience.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Haburger+Tirana+Albania"
      },
      {
        "id": "smash-burger-tirana",
        "name": "Smash Burger Tirana",
        "shortDescription": "American-style smash burger specialist using the signature smashing technique for maximum flavor and crispy edges.",
        "location": "Bllok area, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/smash_burger_tirana.webp",
        "type": "qsr",
        "detailedDescription": "Smash Burger Tirana specializes in the authentic American smash burger technique, where beef patties are literally smashed on the grill to create crispy, caramelized edges while maintaining juicy centers. This cooking method, combined with quality ingredients and classic American-style preparations, delivers the authentic burger experience that has made smash burgers famous worldwide.",
        "keyFeatures": [
          "Smash Technique - Authentic American cooking method for maximum flavor",
          "Crispy Edges - Signature caramelized burger texture",
          "Quality Beef - Fresh, never frozen patties",
          "American Authentic - True to original smash burger traditions",
          "Quick Service - Fast cooking method maintains efficiency"
        ],
        "visitingInfo": "Open daily 11:30-23:30. Fresh beef smashed to order. Popular with burger enthusiasts. Casual dining atmosphere. Takeaway available.",
        "bestTimeToVisit": "Lunch hours (12:00-14:00) for fresh, hot burgers. Early dinner (18:00-20:00) before evening rush.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Smash+Burger+Tirana+Albania"
      },
      {
        "id": "someg-bakery",
        "name": "Someg Bakery and Pasticeri",
        "shortDescription": "Quality Albanian byrek bakery with multiple locations offering decent filling portions and excellent service.",
        "location": "Multiple locations including Rruga Abdyl Frashëri, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/someg_bakery_and_pasticeri.jpg",
        "type": "bakery",
        "detailedDescription": "Someg Bakery and Pasticeri stands out among Tirana's byrek establishments for providing generous filling portions compared to other bakeries. With multiple outlets around the city, Someg has built a reputation for quality Albanian byreks and excellent customer service from friendly staff. Their consistent quality across locations makes them a reliable choice for authentic Albanian pastries.",
        "keyFeatures": [
          "Multiple Locations - Convenient outlets throughout Tirana",
          "Generous Fillings - Decent amount of filling compared to competitors",
          "Quality Albanian Byrek - Authentic preparation and flavors",
          "Excellent Service - Friendly staff known for good customer care",
          "Consistent Quality - Reliable standards across all locations"
        ],
        "visitingInfo": "Multiple locations open daily. Early morning for freshest byreks. Affordable pricing typical of local bakeries. Cash preferred.",
        "bestTimeToVisit": "Early morning (7:00-9:00) for warmest, freshest byreks. Peak breakfast hours when locals queue.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Someg+Bakery+Pasticeri+Tirana+Albania"
      },
      {
        "id": "byrektore-luani",
        "name": "Byrek Special Luani",
        "shortDescription": "Traditional burek specialist offering excellent meat burek and classic Albanian pastries in authentic local setting.",
        "location": "Traditional neighborhood, Tirana",
        "imageUrl": "https://assets.albaniatravelcompanion.com/byrek_special_luani.jpg",
        "type": "qsr",
        "detailedDescription": "Byrektore Luani represents traditional Albanian burek culture at its finest, specializing in classic burek preparations that have satisfied locals for years. This neighborhood establishment is particularly known for their burek me mish (meat burek), prepared using time-honored techniques. The authentic local atmosphere provides visitors with a genuine taste of Albanian fast food culture in a setting where traditions are preserved.",
        "keyFeatures": [
          "Burek Specialist - Focus on traditional Albanian burek varieties",
          "Excellent Meat Burek - Particularly known for burek me mish",
          "Traditional Preparation - Time-honored techniques and recipes",
          "Local Atmosphere - Authentic neighborhood setting",
          "Cultural Experience - Genuine Albanian fast food tradition"
        ],
        "visitingInfo": "Traditional neighborhood location with authentic local atmosphere. Cash preferred. Best visited during morning hours for freshest burek.",
        "bestTimeToVisit": "Morning hours (7:00-10:00) for traditional Albanian breakfast experience. Peak times when locals gather for burek.",
        "mapsUrl": "https://www.google.com/maps/search/?api=1&query=Byrektore+Special+Luani+Tirana+Albania"
      }
    ]
  }
}